In [51]:
import pandas as pd
from vincenty import vincenty as ty

In [5]:
print(ty((103.85,1.25), (103.82, 1.28)))

3.443371

# HDB

In [52]:
hdb = pd.read_csv('Datasets/hdb_geolocation.csv')
hdb.head()

,Address,Address1,Building,Flat Type,Latitude,Longitude,Month,Query,Road Name,Searchval,Town,Blk No,Floor Area Sqm,Lease Commence Date,Postal,Resale Price,X,Y
0,7 TELOK BLANGAH CRES,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,NIL,1 ROOM,1.278361,103.819384,1/9/15,7 TELOK BLANGAH CRES,TELOK BLANGAH CRESCENT,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,BUKIT MERAH,7.0,31.0,1975,90007.0,200000.0,26449.19437,28980.23008
1,7 TELOK BLANGAH CRES,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,NIL,1 ROOM,1.278361,103.819384,1/9/15,7 TELOK BLANGAH CRES,TELOK BLANGAH CRESCENT,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,BUKIT MERAH,7.0,31.0,1975,90007.0,230000.0,26449.19437,28980.23008
2,7 TELOK BLANGAH CRES,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,NIL,1 ROOM,1.278361,103.819384,1/10/15,7 TELOK BLANGAH CRES,TELOK BLANGAH CRESCENT,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,BUKIT MERAH,7.0,31.0,1975,90007.0,201000.0,26449.19437,28980.23008
3,7 TELOK BLANGAH CRES,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,NIL,1 ROOM,1.278361,103.819384,1/10/15,7 TELOK BLANGAH CRES,TELOK BLANGAH CRESCENT,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,BUKIT MERAH,7.0,31.0,1975,90007.0,209000.0,26449.19437,28980.23008
4,7 TELOK BLANGAH CRES,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,NIL,1 ROOM,1.278361,103.819384,1/11/15,7 TELOK BLANGAH CRES,TELOK BLANGAH CRESCENT,7 TELOK BLANGAH CRESCENT SINGAPORE 090007,BUKIT MERAH,7.0,31.0,1975,90007.0,195000.0,26449.19437,28980.23008

In [53]:
hdb_use = hdb[["Address", "Latitude", "Longitude", "Town"]]
hdb_use.drop_duplicates(subset=['Address'], inplace=True)
hdb_use.reset_index(inplace = True)
hdb_use.drop(columns=["index"], inplace = True)
hdb_use.head()

/var/folders/fm/r45pd3w141dg56rt5cl8mht80000gn/T/ipykernel_25169/3664649517.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hdb_use.drop_duplicates(subset=['Address'], inplace=True)
/var/folders/fm/r45pd3w141dg56rt5cl8mht80000gn/T/ipykernel_25169/3664649517.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hdb_use.drop(columns=["index"], inplace = True)

                 Address  Latitude   Longitude         Town
0   7 TELOK BLANGAH CRES  1.278361  103.819384  BUKIT MERAH
1   323 ANG MO KIO AVE 3  1.367890  103.847599   ANG MO KIO
2   314 ANG MO KIO AVE 3  1.366227  103.850086   ANG MO KIO
3   116 ANG MO KIO AVE 4  1.373346  103.836459   ANG MO KIO
4  406 ANG MO KIO AVE 10  1.362005  103.853880   ANG MO KIO

In [54]:
hdb_use.shape

(9825, 4)

## CBD

In [55]:
geo = (1.2840350875163564, 103.85181594399593)
main_list = []
for index, n in hdb_use.iterrows():
    temp = ty(geo, (float(n['Latitude']), float(n['Longitude'])))
    main_list.append([float(n['Latitude']), float(n['Longitude']), 1.2840350875163564, 103.85181594399593, temp])

In [56]:
column = ['hdb_lat', 'hdb_lon', 'cbd_lat', 'cbd_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon   cbd_lat     cbd_lon   distance
0  1.278361  103.819384  1.284035  103.851816   3.663528
1  1.367890  103.847599  1.284035  103.851816   9.284120
2  1.366227  103.850086  1.284035  103.851816   9.090407
3  1.373346  103.836459  1.284035  103.851816  10.022371
4  1.362005  103.853880  1.284035  103.851816   8.624521

In [57]:
output.to_csv("cbd_hdb_matrix.csv")

## Hawker

In [2]:
hawker = pd.read_csv("Datasets/hawker_center.csv")
hawker = hawker[["NAME", "lat", "lon"]]
hawker.head()

                              NAME       lat         lon
0      Market Street Hawker Centre  1.284425  103.850165
1     Marsiling Mall Hawker Centre  1.433539  103.779785
2     Margaret Drive Hawker Centre  1.297486  103.804715
3  Fernvale Hawker Centre & Market  1.391592  103.877060
4        One Punggol Hawker Centre  1.408190  103.904806

In [9]:
hawker.rename(columns={"NAME":"QUERY", "lat": "LATITUDE", "lon": "LONGITUDE"}, inplace= True)
hawker.head()

                             QUERY  LATITUDE   LONGITUDE
0      Market Street Hawker Centre  1.284425  103.850165
1     Marsiling Mall Hawker Centre  1.433539  103.779785
2     Margaret Drive Hawker Centre  1.297486  103.804715
3  Fernvale Hawker Centre & Market  1.391592  103.877060
4        One Punggol Hawker Centre  1.408190  103.904806

In [10]:
hawker.to_json("json/hawker.json", orient="records")

In [6]:
main_list = []
for index, n in hdb_use.iterrows():
    for index, i in hawker.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['lat']), float(i['lon']), temp])

In [7]:
column = ['hdb_lat', 'hdb_lon', 'hawker_lat', 'hawker_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon  hawker_lat  hawker_lon   distance
0  1.278361  103.819384    1.284425  103.850165   3.490672
1  1.278361  103.819384    1.433539  103.779785  17.715631
2  1.278361  103.819384    1.297486  103.804715   2.671543
3  1.278361  103.819384    1.391592  103.877060  14.069900
4  1.278361  103.819384    1.408190  103.904806  17.218095

In [8]:
output.to_csv("hawker_hdb_matrix.csv")

## Shopping Malls

In [6]:
malls = pd.read_csv("Datasets/shopping_mall_2019.csv")
malls.head()

                        Mall Name  LATITUDE   LONGITUDE
0                          100 AM  1.274588  103.843471
1                    313@Somerset  1.301014  103.838361
2                          Aperia  1.310474  103.864313
3  Balestier Hill Shopping Centre  1.325596  103.842572
4                      Bugis Cube  1.298141  103.855635

In [22]:
malls.rename(columns={"Mall Name":"QUERY"}, inplace= True)
malls.head()

                            QUERY  LATITUDE   LONGITUDE
0                          100 AM  1.274588  103.843471
1                    313@Somerset  1.301014  103.838361
2                          Aperia  1.310474  103.864313
3  Balestier Hill Shopping Centre  1.325596  103.842572
4                      Bugis Cube  1.298141  103.855635

In [23]:
malls.to_json("json/malls.json", orient="records")

In [10]:
main_list = []
for index, n in hdb_use.iterrows():
    for index, i in malls.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['LATITUDE']), float(i['LONGITUDE'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['LATITUDE']), float(i['LONGITUDE']), temp])

In [11]:
column = ['hdb_lat', 'hdb_lon', 'mall_lat', 'mall_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon  mall_lat    mall_lon  distance
0  1.278361  103.819384  1.274588  103.843471  2.712936
1  1.278361  103.819384  1.301014  103.838361  3.276366
2  1.278361  103.819384  1.310474  103.864313  6.132745
3  1.278361  103.819384  1.325596  103.842572  5.825686
4  1.278361  103.819384  1.298141  103.855635  4.589159

In [12]:
output.to_csv("malls_hdb_matrix.csv")

## School

In [12]:
schools = pd.read_csv("Datasets/school.csv")
schools.head()

,Address,Dgp Code,Mainlevel Code,Postal Code,School Name,Zone Code,Latitude (generated),Longitude (generated)
0,51 EDGEFIELD PLAINS,PUNGGOL,SECONDARY,828870,PUNGGOL SECONDARY SCHOOL,NORTH,1.4020,103.9091
1,41 EDGEFIELD PLAINS,PUNGGOL,PRIMARY,828869,EDGEFIELD PRIMARY SCHOOL,NORTH,1.4002,103.9075
2,21 EDGEDALE PLAINS,PUNGGOL,PRIMARY,828867,MEE TOH SCHOOL,NORTH,1.3949,103.9086
3,51 EDGEDALE PLAINS,PUNGGOL,SECONDARY,828866,GREENDALE SECONDARY SCHOOL,NORTH,1.3975,103.9116
4,50 Edgedale Plains,PUNGGOL,PRIMARY,828848,GREENDALE PRIMARY SCHOOL,NORTH,1.3964,103.9124

In [13]:
schools_json = schools[["School Name", "Latitude (generated)", "Longitude (generated)"]]
schools_json.head()

                  School Name  Latitude (generated)  Longitude (generated)
0    PUNGGOL SECONDARY SCHOOL                1.4020               103.9091
1    EDGEFIELD PRIMARY SCHOOL                1.4002               103.9075
2              MEE TOH SCHOOL                1.3949               103.9086
3  GREENDALE SECONDARY SCHOOL                1.3975               103.9116
4    GREENDALE PRIMARY SCHOOL                1.3964               103.9124

In [15]:
schools_json.rename(columns={"School Name":"QUERY", "Latitude (generated)": "LATITUDE", "Longitude (generated)": "LONGITUDE"}, inplace= True)
schools_json.head()

/var/folders/fm/r45pd3w141dg56rt5cl8mht80000gn/T/ipykernel_25169/2588218698.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  schools_json.rename(columns={"School Name":"QUERY", "Latitude (generated)": "LATITUDE", "Longitude (generated)": "LONGITUDE"}, inplace= True)

                        QUERY  LATITUDE  LONGITUDE
0    PUNGGOL SECONDARY SCHOOL    1.4020   103.9091
1    EDGEFIELD PRIMARY SCHOOL    1.4002   103.9075
2              MEE TOH SCHOOL    1.3949   103.9086
3  GREENDALE SECONDARY SCHOOL    1.3975   103.9116
4    GREENDALE PRIMARY SCHOOL    1.3964   103.9124

In [16]:
schools_json.to_json("json/schools.json", orient="records")

In [14]:
main_list = []
for index, n in hdb_use.iterrows():
    for index, i in schools.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['Latitude (generated)']), float(i['Longitude (generated)'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['Latitude (generated)']), float(i['Longitude (generated)']), temp])

In [15]:
column = ['hdb_lat', 'hdb_lon', 'school_lat', 'school_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon  school_lat  school_lon   distance
0  1.278361  103.819384      1.4020    103.9091  16.929084
1  1.278361  103.819384      1.4002    103.9075  16.663356
2  1.278361  103.819384      1.3949    103.9086  16.267644
3  1.278361  103.819384      1.3975    103.9116  16.699387
4  1.278361  103.819384      1.3964    103.9124  16.658781

In [16]:
output.to_csv("school_hdb_matrix.csv")

## Parks

In [18]:
parks = pd.read_csv("Datasets/park_points.csv")
parks.head()

   Unnamed: 0                   NAME         lon       lat
0           1   MOUNT SINAI PLAIN PG  103.781178  1.315673
1           2  HOLLAND GROVE VIEW FC  103.782747  1.312506
2           3       HOLLAND GREEN PG  103.782603  1.326775
3           4           Phoenix Park  103.757226  1.375881
4           5   CHENG SOON GARDEN PG  103.771649  1.335837

In [24]:
parks_json = parks[["NAME", "lon", "lat"]]
parks_json.head()

                    NAME         lon       lat
0   MOUNT SINAI PLAIN PG  103.781178  1.315673
1  HOLLAND GROVE VIEW FC  103.782747  1.312506
2       HOLLAND GREEN PG  103.782603  1.326775
3           Phoenix Park  103.757226  1.375881
4   CHENG SOON GARDEN PG  103.771649  1.335837

In [25]:
parks_json.rename(columns={"NAME":"QUERY", "lat": "LATITUDE", "lon": "LONGITUDE"}, inplace= True)
parks_json.head()

/var/folders/fm/r45pd3w141dg56rt5cl8mht80000gn/T/ipykernel_25169/219966986.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  parks_json.rename(columns={"NAME":"QUERY", "lat": "LATITUDE", "lon": "LONGITUDE"}, inplace= True)

                   QUERY   LONGITUDE  LATITUDE
0   MOUNT SINAI PLAIN PG  103.781178  1.315673
1  HOLLAND GROVE VIEW FC  103.782747  1.312506
2       HOLLAND GREEN PG  103.782603  1.326775
3           Phoenix Park  103.757226  1.375881
4   CHENG SOON GARDEN PG  103.771649  1.335837

In [26]:
parks_json.to_json("json/parks.json", orient="records")

In [10]:
main_list = []
for index, n in hdb_use.iterrows():
    for index, i in parks.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['lat']), float(i['lon']), temp])

In [11]:
column = ['hdb_lat', 'hdb_lon', 'park_lat', 'park_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon  park_lat    park_lon   distance
0  1.278361  103.819384  1.315673  103.781178   5.924614
1  1.278361  103.819384  1.312506  103.782747   5.556949
2  1.278361  103.819384  1.326775  103.782603   6.738990
3  1.278361  103.819384  1.375881  103.757226  12.811338
4  1.278361  103.819384  1.335837  103.771649   8.283287

In [12]:
output.to_csv("parks_hdb_matrix.csv")

## Supermarket

In [30]:
supermarket = pd.read_csv("Datasets/supermarket.csv")
supermarket.head()

,Unnamed: 0,LIC_NAME,BLK_HOUSE,STR_NAME,POSTCODE,lon,lat
0,1,LI LI CHENG SUPERMARKET (PUNGGOL) PTE. LTD.,273C,PUNGGOL PLACE,823273,103.901262,1.402303
1,2,SHENG SIONG SUPERMARKET PTE LTD,11,UPPER BOON KENG ROAD,380011,103.870914,1.314239
2,3,COLD STORAGE SINGAPORE (1983) PTE LTD,683,HOUGANG AVENUE 8,530683,103.886366,1.373321
3,4,COLD STORAGE SINGAPORE (1983) PTE LTD,631,BEDOK RESERVOIR ROAD,470631,103.914942,1.332959
4,5,YES SUPERMARKET PTE LTD,201B,TAMPINES STREET 21,522201,103.953010,1.353453

In [48]:
supermarket_json = supermarket[["LIC_NAME", "lon", "lat"]]
supermarket_json.rename(columns={'LIC_NAME':"QUERY", 'lon': "LONGITUDE", 'lat':'LATITUDE'}, inplace=True)
supermarket_json.head()

/var/folders/fm/r45pd3w141dg56rt5cl8mht80000gn/T/ipykernel_25169/516016503.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  supermarket_json.rename(columns={'LIC_NAME':"QUERY", 'lon': "LONGITUDE", 'lat':'LATITUDE'}, inplace=True)

                                         QUERY   LONGITUDE  LATITUDE
0  LI LI CHENG SUPERMARKET (PUNGGOL) PTE. LTD.  103.901262  1.402303
1              SHENG SIONG SUPERMARKET PTE LTD  103.870914  1.314239
2        COLD STORAGE SINGAPORE (1983) PTE LTD  103.886366  1.373321
3        COLD STORAGE SINGAPORE (1983) PTE LTD  103.914942  1.332959
4                      YES SUPERMARKET PTE LTD  103.953010  1.353453

In [49]:
supermarket_json.to_json("json/supermarkets.json", orient="records")

In [24]:
main_list = []
for index, n in hdb_use.iterrows():
    for index, i in supermarket.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['lat']), float(i['lon']), temp])

In [25]:
column = ['hdb_lat', 'hdb_lon', 'supermarket_lat', 'supermarket_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon  supermarket_lat  supermarket_lon   distance
0  1.278361  103.819384         1.402303       103.901262  16.457626
1  1.278361  103.819384         1.314239       103.870914   6.973286
2  1.278361  103.819384         1.373321       103.886366  12.877169
3  1.278361  103.819384         1.332959       103.914942  12.228828
4  1.278361  103.819384         1.353453       103.953010  17.032289

In [26]:
output.to_csv("supermarket_hdb_matrix.csv")

## MRT & LRT

In [37]:
mrt = pd.read_csv("Datasets/mrt_lrt_stations.csv")
mrt.head()

   Unnamed: 0 TYP_CD_DES               STN_NAM_DE         lon       lat
0           1        MRT    ESPLANADE MRT STATION  103.855612  1.293260
1           2        MRT   PAYA LEBAR MRT STATION  103.892272  1.317369
2           3        MRT  DHOBY GHAUT MRT STATION  103.845833  1.299044
3           4        MRT       DAKOTA MRT STATION  103.888668  1.308375
4           5        MRT     LAVENDER MRT STATION  103.862838  1.307372

In [46]:

mrt_only = mrt[mrt.TYP_CD_DES == "MRT"][["STN_NAM_DE", "lon", "lat"]]
lrt_only = mrt[mrt.TYP_CD_DES == "LRT"][["STN_NAM_DE", "lon", "lat"]]
mrt_only.rename(columns={"STN_NAM_DE":"QUERY", 'lon': "LONGITUDE", 'lat':'LATITUDE'}, inplace=True)
lrt_only.rename(columns={"STN_NAM_DE":"QUERY", 'lon': "LONGITUDE", 'lat':'LATITUDE'}, inplace=True)

mrt_only.to_json("json/mrt.json", orient="records")
lrt_only.to_json("json/lrt.json", orient="records")

In [24]:
main_list = []
for index, n in hdb_use.iterrows():
    for index, i in mrt.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['lat']), float(i['lon']), temp])

In [25]:
column = ['hdb_lat', 'hdb_lon', 'mrtlrt_lat', 'mrtlrt_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon  mrtlrt_lat  mrtlrt_lon  distance
0  1.278361  103.819384    1.293260  103.855612  4.355422
1  1.278361  103.819384    1.317369  103.892272  9.187277
2  1.278361  103.819384    1.299044  103.845833  3.727594
3  1.278361  103.819384    1.308375  103.888668  8.394627
4  1.278361  103.819384    1.307372  103.862838  5.803213

In [26]:
output.to_csv("mrtlrt_hdb_matrix.csv")

## Bus Stop

In [43]:
bus = pd.read_csv("Datasets/bus_stop_district.csv")
bus.head()

,Unnamed: 0,BUS_STOP_N,BUS_ROOF_N,LOC_DESC,DISTRICT,lon,lat,amenities_type
0,14,46261,B09,BLK 808,NORTH,103.786877,1.442535,bus_stop
1,19,46709,B03,AFT BLK 1,NORTH,103.775495,1.441471,bus_stop
2,20,46831,B03,BLK 747A CP,NORTH,103.795645,1.443625,bus_stop
3,41,49249,B08,AFT NEO TIEW RD,NORTH,103.725489,1.437088,bus_stop
4,44,58019,B22,AFT SEMBAWANG SHOP CTR,NORTH,103.824740,1.440828,bus_stop

In [44]:
bus_json = bus[["LOC_DESC", "lon", "lat"]]
bus_json.rename(columns={"LOC_DESC":"QUERY", 'lon': "LONGITUDE", 'lat':'LATITUDE'}, inplace=True)
bus_json.head()

/var/folders/fm/r45pd3w141dg56rt5cl8mht80000gn/T/ipykernel_25169/530643279.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bus_json.rename(columns={"LOC_DESC":"QUERY", 'lon': "LONGITUDE", 'lat':'LATITUDE'}, inplace=True)

                    QUERY   LONGITUDE  LATITUDE
0                 BLK 808  103.786877  1.442535
1               AFT BLK 1  103.775495  1.441471
2             BLK 747A CP  103.795645  1.443625
3         AFT NEO TIEW RD  103.725489  1.437088
4  AFT SEMBAWANG SHOP CTR  103.824740  1.440828

In [47]:
bus_json.to_json("json/bus.json", orient="records")

In [15]:
main_list = []
for index, n in hdb_use.iterrows():
    trest = bus.loc[(abs(float(n['Latitude']) - bus['lat'].astype('float')) <= 0.03) & (abs(float(n['Longitude']) - bus['lon'].astype('float')) <= 0.03)]
    for index, i in trest.iterrows():
        temp = ty((float(n['Latitude']), float(n['Longitude'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['Latitude']), float(n['Longitude']), float(i['lat']), float(i['lon']), temp])

<= 400 rows for each hdb

In [16]:
column = ['hdb_lat', 'hdb_lon', 'bus_lat', 'bus_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

    hdb_lat     hdb_lon   bus_lat     bus_lon  distance
0  1.278361  103.819384  1.291127  103.802487  2.351331
1  1.278361  103.819384  1.281104  103.818521  0.318111
2  1.278361  103.819384  1.300711  103.841059  3.453443
3  1.278361  103.819384  1.299866  103.840847  3.370447
4  1.278361  103.819384  1.277050  103.818008  0.210897

In [17]:
output.shape

(4379124, 5)

In [18]:
output.to_csv("Raw Matrix/bus_hdb_matrix.csv")

# Private

In [58]:
private = pd.read_csv("Datasets/addresses.csv")
private.head()

,QUERY,SEARCHVAL,BLK_NO,ROAD_NAME,BUILDING,ADDRESS,POSTAL,X,Y,LATITUDE,LONGITUDE
0,THE TRUMPS JALAN KEMBANGAN,THE TRUMPS,1,JALAN KEMBANGAN,THE TRUMPS,1 JALAN KEMBANGAN THE TRUMPS SINGAPORE 419154,419154,36921.990442,33587.440681,1.320026,103.913487
1,PARC RIVIERA WEST COAST VALE,PARC RIVIERA,101,WEST COAST VALE,PARC RIVIERA,101 WEST COAST VALE PARC RIVIERA SINGAPORE 126753,126753,19024.308232,33674.972542,1.320818,103.752667
2,D'LEEDON LEEDON HEIGHTS,D'LEEDON,1,LEEDON HEIGHTS,D'LEEDON,1 LEEDON HEIGHTS D'LEEDON SINGAPORE 267939,267939,24547.934373,33152.108590,1.316090,103.802300
3,368 THOMSON THOMSON ROAD,368 THOMSON,368,THOMSON ROAD,368 THOMSON,368 THOMSON ROAD 368 THOMSON SINGAPORE 298127,298127,28963.769352,34368.535391,1.327091,103.841979
4,ONE LEICESTER LEICESTER ROAD,ONE LEICESTER,1,LEICESTER ROAD,ONE LEICESTER,1 LEICESTER ROAD ONE LEICESTER SINGAPORE 358828,358828,31788.154820,34627.234667,1.329431,103.867357

In [59]:
private_use = private[["LATITUDE", "LONGITUDE"]]
private_use.head()

   LATITUDE   LONGITUDE
0  1.320026  103.913487
1  1.320818  103.752667
2  1.316090  103.802300
3  1.327091  103.841979
4  1.329431  103.867357

In [60]:
private_use.shape

(4572, 2)

## CBD

In [62]:
geo = (1.2840350875163564, 103.85181594399593)
main_list = []
for index, n in private_use.iterrows():
    temp = ty(geo, (float(n['LATITUDE']), float(n['LONGITUDE'])))
    main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), 1.2840350875163564, 103.85181594399593, temp])

In [63]:
column = ['private_lat', 'private_lon', 'cbd_lat', 'cbd_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon   cbd_lat     cbd_lon   distance
0     1.320026   103.913487  1.284035  103.851816   7.933797
1     1.320818   103.752667  1.284035  103.851816  11.760063
2     1.316090   103.802300  1.284035  103.851816   6.552174
3     1.327091   103.841979  1.284035  103.851816   4.885195
4     1.329431   103.867357  1.284035  103.851816   5.309241

In [64]:
output.to_csv("cbd_private_matrix.csv")

## Hawker

In [19]:
main_list = []
for index, n in private_use.iterrows():
    for index, i in hawker.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['lat']), float(i['lon']), temp])

In [20]:
column = ['private_lat', 'private_lon', 'hawker_lat', 'hawker_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon  hawker_lat  hawker_lon   distance
0     1.320026   103.913487    1.284425  103.850165   8.072155
1     1.320026   103.913487    1.433539  103.779785  19.466412
2     1.320026   103.913487    1.297486  103.804715  12.359252
3     1.320026   103.913487    1.391592  103.877060   8.891355
4     1.320026   103.913487    1.408190  103.904806   9.796470

In [21]:
output.to_csv("hawker_private_matrix.csv")

## Shopping Malls

In [22]:
main_list = []
for index, n in private_use.iterrows():
    for index, i in malls.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['LATITUDE']), float(i['LONGITUDE'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['LATITUDE']), float(i['LONGITUDE']), temp])

In [23]:
column = ['private_lat', 'private_lon', 'mall_lat', 'mall_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon  mall_lat    mall_lon  distance
0     1.320026   103.913487  1.274588  103.843471  9.271580
1     1.320026   103.913487  1.301014  103.838361  8.621121
2     1.320026   103.913487  1.310474  103.864313  5.573602
3     1.320026   103.913487  1.325596  103.842572  7.916202
4     1.320026   103.913487  1.298141  103.855635  6.878150

In [24]:
output.to_csv("malls_private_matrix.csv")

## School

In [26]:
main_list = []
for index, n in private_use.iterrows():
    for index, i in schools.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['Latitude (generated)']), float(i['Longitude (generated)'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['Latitude (generated)']), float(i['Longitude (generated)']), temp])

In [27]:
column = ['private_lat', 'private_lon', 'school_lat', 'school_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon  school_lat  school_lon  distance
0     1.320026   103.913487      1.4020    103.9091  9.077396
1     1.320026   103.913487      1.4002    103.9075  8.890226
2     1.320026   103.913487      1.3949    103.9086  8.297020
3     1.320026   103.913487      1.3975    103.9116  8.569243
4     1.320026   103.913487      1.3964    103.9124  8.445903

In [28]:
output.to_csv("school_private_matrix.csv")

## Parks

In [15]:
main_list = []
for index, n in private_use.iterrows():
    for index, i in parks.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['lat']), float(i['lon']), temp])

In [17]:
column = ['private_lat', 'private_lon', 'park_lat', 'park_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon  park_lat    park_lon   distance
0     1.320026   103.913487  1.315673  103.781178  14.732598
1     1.320026   103.913487  1.312506  103.782747  14.573869
2     1.320026   103.913487  1.326775  103.782603  14.585216
3     1.320026   103.913487  1.375881  103.757226  18.454321
4     1.320026   103.913487  1.335837  103.771649  15.881675

In [18]:
output.to_csv("parks_private_matrix.csv")

## Supermarkets

In [31]:
main_list = []
for index, n in private_use.iterrows():
    for index, i in supermarket.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['lat']), float(i['lon']), temp])

In [32]:
column = ['private_lat', 'private_lon', 'supermarket_lat', 'supermarket_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon  supermarket_lat  supermarket_lon  distance
0     1.320026   103.913487         1.402303       103.901262  9.198928
1     1.320026   103.913487         1.314239       103.870914  4.781010
2     1.320026   103.913487         1.373321       103.886366  6.621064
3     1.320026   103.913487         1.332959       103.914942  1.439188
4     1.320026   103.913487         1.353453       103.953010  5.745272

In [33]:
output.to_csv("supermarket_private_matrix.csv")

## MRT & LRT

In [37]:
main_list = []
for index, n in private_use.iterrows():
    for index, i in mrt.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['lat']), float(i['lon']), temp])

In [38]:
column = ['private_lat', 'private_lon', 'mrtlrt_lat', 'mrtlrt_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon  mrtlrt_lat  mrtlrt_lon  distance
0     1.320026   103.913487    1.293260  103.855612  7.088462
1     1.320026   103.913487    1.317369  103.892272  2.379237
2     1.320026   103.913487    1.299044  103.845833  7.878618
3     1.320026   103.913487    1.308375  103.888668  3.047787
4     1.320026   103.913487    1.307372  103.862838  5.807880

In [39]:
output.to_csv("mrtlrt_private_matrix.csv")

## Bus Stop

In [19]:
main_list = []
for index, n in private_use.iterrows():
    trest = bus.loc[(abs(float(n['LATITUDE']) - bus['lat'].astype('float')) <= 0.03) & (abs(float(n['LONGITUDE']) - bus['lon'].astype('float')) <= 0.03)]
    for index, i in trest.iterrows():
        temp = ty((float(n['LATITUDE']), float(n['LONGITUDE'])), (float(i['lat']), float(i['lon'])))
        main_list.append([float(n['LATITUDE']), float(n['LONGITUDE']), float(i['lat']), float(i['lon']), temp])

<= 400 rows for each hdb

In [20]:
column = ['private_lat', 'private_lon', 'bus_lat', 'bus_lon', 'distance']
output = pd.DataFrame(main_list,columns=column)
output.head()

   private_lat  private_lon   bus_lat     bus_lon  distance
0     1.320026   103.913487  1.307178  103.917586  1.492111
1     1.320026   103.913487  1.301153  103.897498  2.742550
2     1.320026   103.913487  1.328212  103.902890  1.486682
3     1.320026   103.913487  1.333840  103.898446  2.266109
4     1.320026   103.913487  1.337660  103.887064  3.528363

In [21]:
output.shape

(1584300, 5)

In [22]:
output.to_csv("Raw Matrix/bus_private_matrix.csv")